In [12]:
import numpy as np 
import pandas as pd
from matplotlib import pyplot as plt

In [13]:
df = pd.read_excel('shop.xlsx')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [14]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [15]:
df.columns  #to show columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [16]:
df1 = df.copy()   #dataframe copy
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

# Normalization

In [27]:
from sklearn.preprocessing import MinMaxScaler
mm = MinMaxScaler(feature_range=(0,1))   #feature range only for normalization will give value range(0-1)

In [29]:
df1['Marketing Spend'] = mm.fit_transform(df1[["Marketing Spend"]])

In [25]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [31]:
df1['Administration'] = mm.fit_transform(df1[["Administration"]])

In [32]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [33]:
df1['Transport'] = mm.fit_transform(df1[["Transport"]])
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Standardization

In [34]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [35]:
df2['Marketing Spend'] = ss.fit_transform(df2[['Marketing Spend']])
df2['Profit'] = ss.fit_transform(df2[['Profit']])
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913       136897.80  471784.10    Dhaka  2.011203
1         1.955860       151377.59  443898.53      Ctg  1.999430
2         1.754364       101145.55  407934.54  Rangpur  1.980842
3         1.554784       118671.85  383199.62    Dhaka  1.776627
4         1.504937        91391.77  366168.42  Rangpur  1.357740

# Robust Scaler

In [36]:
from sklearn.preprocessing import RobustScaler
rs = RobustScaler()

In [37]:
df3['Transport'] = rs.fit_transform(df3[['Transport']])
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80   1.552016    Dhaka  192261.83
1        162597.70       151377.59   1.383714      Ctg  191792.06
2        153441.51       101145.55   1.166654  Rangpur  191050.39
3        144372.41       118671.85   1.017368    Dhaka  182901.99
4        142107.34        91391.77   0.914576  Rangpur  166187.94

# Max Absolute Scaler

In [38]:
from sklearn.preprocessing import MaxAbsScaler
mas = MaxAbsScaler()

In [39]:
df4['Transport'] = mas.fit_transform(df4[['Transport']])
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80   1.000000    Dhaka  192261.83
1        162597.70       151377.59   0.940893      Ctg  191792.06
2        153441.51       101145.55   0.864664  Rangpur  191050.39
3        144372.41       118671.85   0.812235    Dhaka  182901.99
4        142107.34        91391.77   0.776136  Rangpur  166187.94